Repository: NarodGaming/hardwaremod-revamped
Catalog: translation/greek/hardware mod revamped greek - 70 finished.xliff
Languages: el

source: ARM System-On-A-Chip
el: Σύστημα-Σε-Τσιπ (ΣΣΤ) ARM (ΑΣΕR)

source: Build System-On-A-Chips for ARM based products!
el: Φτιάξτε ΣΣΤ (SOC) στα προϊόντα που είναι βασισμένα σε ARM (αρχιτεκτονική συνόλου εντολών RISC)!

source: Tablet
el: Τάμπλετ

source: Build an ARM SOC for a tablet.
el: Φτιάξτε ένα ΣΣΤ (SOC) ΑΣΕR (ARM) για ένα τάμπλετ.

source: Phone
el: Τηλέφωνο

source: Build an ARM SOC for a phone.
el: Φτιάξτε ένα ΣΣΤ (SOC) ΑΣΕR (ARM) για ένα τηλέφωνο.

source: Laptop
el: Λάπτοπ

source: Build an ARM SOC for a laptop.
el: Φτιάξτε ένα ΣΣΤ (SOC) ΑΣΕR (ARM) για ένα λάπτοπ.

source: Single Core
el: Μονο-πύρηνο

source: It gets one thing done at a time.
el: Τελειώνει ένα πράγμα κάθε φορά.

source: Dual Core
el: Διπλο-πύρηνο

source: Two things at a time!
el: Δύο πράγματα ταυτόχρονα!

source: Tri Core
el: Τρι-πύρηνο

source: Three things at once!
el: Τρία πράγματα ταυτόχρονα!

source: Quad Core
el: Τετρα-πύρηνο

source: Four things at once?? Madness.
el: Τέσσερα πράγματα ταυτόχρονα; Τρέλα.

source: Octa Core
el: Οκτα-πύρηνο

source: Eight things at once? Are you insane?
el: Οκτώ πράγματα ταυτόχρονα; Είσαι τρελός;

source: big.LITTLE Architecture
el: μεγάλη.ΜΙΚΡΗ Αρχιτεκτονική

source: Saving power whilst offering more performance? Wow!
el: Εξοικονόμηση ενέργειας, ενώ προσφέρει περισσότερη απόδοση; Πω πω!

source: Basic Video Output Support
el: Υποστήριξη Βασικής Εξόδου Βίντεο

source: Perfect for simple things, like... calculators
el: Ιδανικό για απλά πράγματα, όπως... αριθμομηχανές

source: 240p Video Support
el: Υποστήριξη 240p βίντεο

source: Perfect for basic screens!
el: Ιδανικό για βασικές οθόνες!

source: VGA Video Support
el: Υποστήριξη βίντεο VGA

source: A perfect standard!
el: Ένα τέλειο πρότυπο!

source: HD Video Support
el: Υποστήριξη HD βίντεο

source: A retina standard.
el: Ένα πρότυπο για τα μάτια μου.

source: FHD Video Support
el: Υποστήριξη βίντεο FHD

source: True retina.
el: Πραγματικά ένα πρότυπο για τα μάτια μου.

source: QHD Video Support
el: Υποστήριξη QHD βίντεο

source: Best (VR) Quality
el: Καλύτερη ποιότητα (VR)

source: Performance
el: Απόδοση

source: Performance update for your tech!
el: Ενημέρωση επίδοσης για την τεχνολογία σας!

source: LPDDR Support
el: Υποστήριξη LPDDR

source: Low powered DDR! It's a start atleast...
el: Χαμηλή τροφοδότηση DDR! Είναι μια αρχή τουλάχιστον...

source: LPDDR2 Support
el: Υποστήριξη LPDDR2

source: Low powered DDR2! Alright I guess...
el: Χαμηλή τροφοδοσία DDR2! Εντάξει υποθέτω...

source: LPDDR3 Support
el: Υποστήριξη LPDDR3

source: Low powered DDR3! Damn standards...
el: Χαμηλή τροφοδοσία DDR3! Καταραμένο πρότυπο...

source: LPDDR4 Support
el: Υποστήριξη LPDDR4

source: Low powered DDR4! Wow that speed...
el: Χαμηλή τροφοδοσία DDR4! Πω Πω αυτή η ταχύτητα...

source: QuickCharge Technology
el: Τεχνολογία Ταχείας Φόρτισης

source: Charge your phone x% in x minutes!
el: Φορτίστε το τηλέφωνό σας x % σε x λεπτά!

source: SnapCharge Technology
el: Τεχνολογία Ασύρματης Φόρτισης

source: Even faster than ever before!
el: Ακόμη πιο γρήγορα από ποτέ!

source: Dash Charge
el: Ταχύτατη Φόρτιση

source: Charge your phone up to 40% in 15 minutes!
el: Φορτίστε το τηλέφωνό σας έως και 40% μέσα σε 15 λεπτά!

source: Dash Charge Extreme
el: Ακραία Ταχύτατη Φόρτιση

source: Charge your phone up to 60% in 15 minutes!
el: Φορτίστε το τηλέφωνό σας έως και 60% μέσα σε 15 λεπτά!

source: Power Efficiency
el: Ενεργειακή Απόδοση

source: It's not very mobile if the battery dries up instantly...
el: Δεν είναι πολύ κινητό αν η μπαταρία στραγγίζει αμέσως...

source: More Power Efficient
el: Περισσότερη Ενεργειακή Αποδοτική

source: Have even more battery left at the end of the day!
el: Έχουν ακόμη περισσότερη μπαταρία διαθέσιμη στο τέλος της ημέρας!

source: Storages
el: Χώροι Αποθήκευσης

source: Storage
el: Χώρος Αποθήκευσης

source: Memory
el: Μνήμη

source: Monitors
el: Οθόνες

source: Monitor
el: Οθόνη

source: PC Cases
el: Πύργοι Υπολογιστών

source: Case
el: Πύργος

source: Computers
el: Υπολογιστές

source: Computer
el: Υπολογιστής

source: ARM SOC
el: ΣΣΤ (SOC) ARM (αρχιτεκτονική συνόλου εντολών RISC)

source: ARM System-On-A-Chip
el: Σύστημα-Σε-Τσιπ (ΣΣΤ) ARM (ΑΣΕR)

source: ARM Technologies
el: Τεχνολογίες ΑΣΕR (αρχιτεκτονική συνόλου εντολών RISC)

source: Low-Powered Memory
el: Μνήμη Χαμηλής-Κατανάλωσης

source: Mobile Phones
el: Κινητά Τηλέφωνα

source: Mobile Phone
el: Κινητό Τηλέφωνο

source: Motherboards
el: Μητρικές Κάρτες

source: Motherboard
el: Μητρική Κάρτα

source: Processors
el: Επεξεργαστές

source: Processor
el: Επεξεργαστής

source: Graphics Cards
el: Κάρτες Γραφικών

source: Graphics Card
el: Κάρτα Γραφικών

source: Capture Card
el: Κάρτα Καταγραφής

source: Low-Powered Memory
el: Μνήμη Χαμηλής-Κατανάλωσης

source: Create RAM for ARM based products!
el: Φτιάξτε μνήμη RAM για προϊόντα βασισμένα σε ΑΣΕR (ARM)!

source: Default
el: Προεπιλεγμένο

source: Memory Interface
el: Μνήμη Διεπαφής

source: Allows the RAM to interface with the motherboard
el: Επιτρέπει στη μνήμη RAM να διασυνδέσεται με τη μητρική κάρτα

source: DIMM Interfacing
el: Διασύνδεση ΔΕΣΜ (DIMM)

source: A easy standard, reduces time needed.
el: Ένα εύκολο πρότυπο, μειώνει το χρόνο που απαιτείται.

source: Soldered on RAM
el: Συγκολλημένες στην RAM

source: Even easier! Solder it to the motherboard!
el: Ακόμα πιο εύκολο! Κολλήσεις με τη μητρική κάρτα!

source: It supports LPDDR1 motherboards. Nothing special really.
el: Υποστηρίζει LPDDR1 μητρικές κάρτες. Τίποτα το ιδιαίτερο, πραγματικά.

source: LPDDR2! Improving speed, power and size!
el: LPDDR2! Βελτίωση της ταχύτητα, δύναμη και μέγεθος!

source: LPDDR3! To the mainstream...
el: LPDDR3! Για το mainstream...

source: LPDDR4! Speed, effciency, size, all in one.
el: LPDDR4! Ταχύτητα, αποδοτικότητα, μέγεθος, όλα σε ένα.

source: Battery Mode
el: Λειτουργία (Mode) Μπαταρίας

source: A Standard mode, underclock the RAM to save battery!
el: Σε Τυπική λειτουργία, underclock την μνήμη RAM για να εξοικονομίσει την μπαταρία!

source: Standard Speed
el: Τυπική Ταχύτητα

source: A entry mode, standard ram speed for improved peformance.
el: Μια λειτουργία εισόδου, ταχύτητα τυπικής μνήμης ram για βελτίωση των επιδόσεών της.

source: Regular Peformance
el: Τακτική επιδόση

source: Push the RAM slightly further, get extra performance for games.
el: Σπρώξτε τη μνήμη RAM ελαφρώς περαιτέρω, να λάβετε επιπλέον απόδοση για τα παιχνίδια.

source: Race Peformance
el: Επιδόσεις Αγώνα

source: Draw extra voltage for safe overclocking.
el: Σχεδιάστε επιπλέον τάσης για ασφαλή overclocking.

source: XMP Profiling
el: ΕΜΠ (XMP) Προφίλ

source: Safely push alot more Mhz with no extra voltage!
el: Σπρώξτε με ασφάλεια πολλά περισσότερα Mhz χωρίς καμία επιπλέον τάση!

source: XMP 2.0
el: ΕΜΠ (XMP) 2.0

source: Maximum peformance!
el: Μέγιστο των επιδόσεων του!

source: Mobile Phone
el: Κινητό τηλέφωνο

source: Make a mobile phone to sell to the masses!
el: Κάντε έναν κινητό τηλέφωνο να πωλήται στις μάζες!

source: Default
el: Προεπιλεγμένο

source: A phone. What more could you want.
el: Ένα κινητό. Τι περισσότερο θα μπορούσατε να θέλετε.

source: Phone Casing
el: Θήκη Κινητού

source: Well, what else are you going to put the parts in?!
el: Λοιπόν, τι άλλο πρόκειται να βάλετε στα μέρη?!

source: Phone Casing with Camera Cut-Out
el: Θήκη Κινητού με Απόκομα για την Κάμερα

source: Allows you to add in a camera.
el: Σας επιτρέπει να προσθέσετε σε κάμερα.

source: Speaker Amplifier
el: Ενισχυτής Ηχείων

source: You'll need these for sound. Isn't it obvious? No? Ok.
el: Θα χρειαστείτε αυτά για τον ήχο. Δεν είναι προφανές; Όχι? Ok.

source: Speaker
el: Ηχείο

source: Would make sense to have these with the amp? No? It's your phone not mine...
el: Θα ήταν λογικό να έχετε αυτά με τον ενισχυτή; Όχι? Δικό σας είναι το τηλέφωνο, όχι δικό μου...

source: Stereo Speakers
el: Στερεοφωνικά Ηχεία

source: Two speakers are better than one. (in theory)
el: Δύο ηχεία είναι καλύτερα από ένα. (θεωρητικά)

source: 3.5mm Jack
el: Βύσμα υποδοχής 3.5χιλ

source: For listening to music through headphones (not included)
el: Για να ακούτε μουσική μέσω των ακουστικών (δεν περιλαμβάνονται)

source: 3.5mm Combi-Jack
el: Βύσμα Combi-υποδοχής 3,5 χιλ

source: Plug headphones and a microphone into the same port, at the same time!
el: Συνδέστε ακουστικά και ένα μικρόφωνο στην ίδια θύρα, την ίδια στιγμή!

source: Microphone
el: Μικρόφωνο

source: For making calls, you know, the point of a phone? Oh forget it.
el: Για την πραγματοποίηση κλήσεων, ξέρεις, το νόημα του τηλεφώνου; Ω Ξέχνα το.

source: Monochrome Display
el: Μονόχρωμη Οθόνη

source: A basic monochrome screen, two colours, low resolution.
el: Μια βασική μονόχρωμη οθόνη, δύο χρώματα, χαμηλή ανάλυση.

source: LCD TFT Display
el: Οθόνη LCD TFT

source: Yay for colours, its a shame theres about 2 degrees of viewing angles!
el: Μπιάχ για τα χρώματα, είναι μια ντροπή είναι περίπου 2 μοιρών γωνίες θέασης!

source: LCD TFT TouchDisplay
el: LCD TFT Οθόνη Αφής

source: No advancement in the same awful display, but you can poke it now!
el: Καμία πρόοδος στην ίδια απαίσια οθόνη, αλλά μπορείτε να την τσεπόσετε το τώρα!

source: IPS TouchDisplay
el: ΑΣΕ (IPS) Οθόνη Αφής

source: Touchscreen and a display that isn't absoultely dreadful. Madness.
el: Οθόνη αφής και μια οθόνη που δεν είναι τόσο φοβερή. Τρέλα.

source: The brains of the phone. The thing that does it all. 42.
el: Οι εγκέφαλοι του τηλεφώνου. Το πράγμα που τα κάνει όλα. 42.

source: Motherboard
el: Μητρική Κάρτα

source: A circuitboard which you plug other components in to.
el: Μια πλακέτα κυκλωμάτων στην οποία συνδέετε άλλα εξαρτήματα.

source: Consumer
el: Καταναλωτής

source: Geared towards individuals, these less powerful computeres are easier to make; but consumers replace them fairly often.
el: Στραμένοι προς τα άτομα, αυτοί οι λιγότερο ισχυροί υπολογιστές είναι ευκολότερο να φτιαχτούν. αλλά οι καταναλωτές τις αντικαθιστούν αρκετά συχνά.

source: Server
el: Διακομιστής (Server)

source: Geared towards businesses, these more powerful computers are harder to make and must be stable; but businesses don't upgrade often.
el: Στραμένοι προς τις επιχειρήσεις, αυτοί οι πιο ισχυροί υπολογιστές είναι πιο δύσκολο να φτιαχτούν και πρέπει να είναι σταθεροί: αλλά οι επιχειρήσεις δεν αναβαθμίζουν συχνά.

source: Out of Band Management
el: Έξω από τη ζώνη διαχείρισης

source: A serial port or ethernet port (when internet comes around) to work with the server, when you can't just be local to it.
el: Μια σειριακή θύρα ή θύρα ethernet (όταν το Διαδίκτυο έρχεται γύρω γύρω) για να συνεργαστεί με το διακομιστή, όταν δεν μπορείτε να είστε τοπικά με αυτό.

source: Remote Power
el: Απομακρυσμένη Ενέργεια

source: Allows you to remotely turn the server on/off.
el: Σας επιτρέπει να χειριστείτε από απόσταση το διακομιστή για ενεργοποίηση/απενεργοποίηση.

source: Remote Input
el: Απομακρυσμένη Είσοδος

source: Allows you to remotely press certain keys, often useful to stop a server from rebooting.
el: Σας επιτρέπει να χειριστείτε σε απόσταση με το πάτημα συγκεκριμένων πλήκτρων, συχνά χρήσιμο για να σταματήσετε ένα διακομιστή από την επανεκκίνηση.

source: Remote Video
el: Απομακρυσμένη Εικόνα Βίντεο

source: Allows you to actually see what's on the screen, and interact with the server remotely.
el: Σας επιτρέπει να δείτε τι είναι στην οθόνη σε πραγματικό χρόνο και να αλληλεπιδράτε με το διακομιστή εξ αποστάσεως.

source: Remote Audio
el: Απομακρυσμένος Ήχος

source: Allows you hear what's going on the server, such as music or local input devices.
el: Σας επιτρέπει να ακούσετε τι συμβαίνει στο διακομιστή, όπως μουσική ή τοπικές συσκευές εισόδου.

source: CMOS Battery
el: Μπαταρία ΣΗΜΟ (CMOS)

source: Exists to keep the system time, configuration, and allow for logging systems to flush when the system loses power.
el: Υπάρχει για να κρατήσει το σύστημα χρόνου, διαμόρφωσης, και επιτρέπει την καταγραφή του συστήματος όταν το σύστημα χάνει την ενέργειά του.

source: Allows for configuration management, log viewing, and tweaking of the computer system.
el: Επιτρέπει τη Διαχείριση διαμόρφωσης των παραμέτρων, προβολής καταγραφής και μικροαλλαγών του συστήματος του υπολογιστή.

source: he BIOS just wasn't good enough ...
el: ίδιο BIOS, απλά δεν ήταν αρκετά καλό...

source: CPU Socket
el: Υποδοχή CPU

source: Somewhere to shove that fine thinkin' brain of yours.
el: Κάπου να χώσουν το πρόστιμο της σκέψης του μυαλό σου.

source: Dual Socket
el: Διπλή Υποδοχή

source: TWICE THE PROCESSORS
el: ΔΥΟ ΟΙ ΕΠΕΞΕΡΓΑΣΤΕΣ

source: Quad Socket
el: Τεσσάρων Υυποδοχών

source: FOUR THE PROCESSORS
el: ΤΕΣΣΕΡΙΣ ΟΙ ΕΠΕΞΕΡΓΑΣΤΕΣ

source: Daughter Board support
el: Υποστήριξη Θυγατρικής Κάρτας

source: Adds support for Daughter Boards, which can be added to the Computer to increase processing power.
el: Προσθέτει υποστήριξη για θυγατρικές κάρτες, οι οποίες μπορούν να προστεθούν στον υπολογιστή για να αυξηθεί η δύναμη επεξεργασίας.

source: Adding features to the BIOS/UEFI that let the user control the speed of their Processor, which also creates more heat and is unstable.
el: Προσθέτοντας χαρακτηριστικά στο BIOS/UEFI που επιτρέπουν το χρήστη να ελέγξει την ταχύτητα του επεξεργαστή του, η οποία επίσης δημιουργεί περισσότερη θερμότητα και είναι ασταθής.

source: Water Cooling
el: Ψύκτρα Νερού

source: Helps stabilize overclocking
el: Βοηθά στη σταθεροποίηση του overclocking

source: Nitrogen Cooling
el: Ψύξη Αζώτου

source: Try not to freeze yourself
el: Προσπαθήστε να μην παγώσετε τον εαυτό σας

source: Subzero Cooling
el: Ψύξη Υπό το Μηδέν

source: Insert movie reference here
el: Εισαγάγετε εδώ την αναφορά ταινίας

source: 14k Modem
el: 14Κ Μόντεμ (Modem)

source: THIS MAKES YOU THEIR ISP, WATCH YOUR BANDWIDTH
el: ΑΥΤΟ ΣΑΣ ΚΑΘΙΣΤΑ ΤΗΝ ΥΠΗΡΕΣΙΑ ΠΑΡΟΧΗΣ INTERNET, ΠΡΟΣΕΧΤΕ ΤΟ ΕΥΡΟΣ ΖΩΝΗΣ ΣΑΣ

source: 56k Modem
el: 56Κ Μόντεμ (Modem)

source: Upgrade everyone's modems to 56k
el: Αναβάθμιση του καθενός μόντεμ σε 56Κ

source: Broadband
el: Ευρυζωνικότητα

source: Upgrade everyone's modems to Broadband
el: Αναβάθμιση του καθενός μόντεμ σε ευρείαα ζώνη

source: Dual NIC
el: Διπλή ΕΔΔ (NIC)

source: Two network interfaces configured in a mode called 'bonding' which allows them to handle packets for each other. Considered to be more stable than having only one.
el: Δύο διασυνδέσεις δικτύου έχει ρυθμιστεί σε λειτουργία που ονομάζεται «συγκόλληση» που τους επιτρέπει να χειρίζoνται τα πακέτα για μεταξύ τους. Θεωρείται ότι είναι πιο σταθερό αντί έχοντας μόνο ένα.

source: Cable
el: Καλώδιο

source: Upgrade everyone's modems to Cable
el: Αναβάθμιση του καθενός μόντεμ σε καλώδιο

source: Fiber
el: Ίνα

source: FASTER THAN LIGHT: FTL
el: ΓΡΗΓΟΡΟΤΕΡΟ ΑΠΟ ΤΟ ΦΩΣ: ΓΑΦ

source: RAM Slots (DRAM)
el: Υποδοχές μνήμης RAM (ΜΤΠ - DRAM)

source: Somewhere to shove the memory.
el: Κάπου για να σπρώχνω τη μνήμη.

source: SDRAM
el: ΣΔΜΤΠ (SDRAM)

source: Synchronous dynamic random-access memory.
el: Σύγχρονη δυναμική μνήμη τυχαίας προσπέλασης.

source: DDR
el: ΔΡΔ (DDR)

source: Waaaaay faster!
el: Ναιιιιι γρηγορότερα!

source: DDR2
el: ΔΡΠ2 (DDR2)

source: Waaaaaaaaay faster!
el: Ναιιιι πιο γρήγορα!

source: DDR3
el: ΔΡΠ3 (DDR3)

source: Waaaaaaaaaaaaaaay faster!
el: Ναιιιιι πιο γρήγορα!

source: DDR4
el: ΔΡΠ4 (DDR4)

source: Waaaaaaaaaaaaaaaaaaaaaay faster!
el: Ναιιιιι πιο γρήγορα!

source: DDR5
el: ΔΡΠ5 (DDR5)

source: Super speed.
el: Σούπερ ταχύτητα.

source: PCI Slots
el: Υποδοχές ΠΔΣ (PCI)

source: Slots that let users install additional hardware, currently only Graphics Cards require PCI.
el: Οι υποδοχές που επιτρέπουν στους χρήστες να εγκαταστήσουν πρόσθετο εξάρτημα, επί του παρόντος μόνο κάρτες γραφικών απαιτούν ΠΔΣ (PCI).

source: AGP
el: ΣΘΓ (AGP)

source: A bus dedicated to graphics adapters.
el: Ένα λεωφορείο αφιερωμένο σε προσαρμογές γραφικών.

source: AGP x8
el: ΣΘΓ (AGP) x8

source: A bus dedicated to graphics adapters x8.
el: Ένα λεωφορείο αφιερωμένο σε προσαρμογές γραφικών x8.

source: PCI Express
el: ΠΔΣ Εξπρές (PCI Express)

source: A much faster version of PCI, must match the Graphics Cards being used.
el: Μια πολύ ταχύτερη έκδοση του ΠΔΣ (PCI), θα πρέπει να ταιριάζει με τις κάρτες γραφικών που χρησιμοποιείται.

source: SLl Support
el: Υποστήριξη ΑΕΥ (SLl)

source: Allows for the use of two graphics cards.
el: Επιτρέπει τη χρήση δύο καρτών γραφικών.

source: Triple SLl
el: Τριπλό ΑΕΥ (SLl)

source: Now you can fit three graphics cards.
el: Τώρα μπορείτε να χωρέσει τρεις κάρτες γραφικών.

source: Quad SLl
el: Τετραπλό ΑΕΥ (SLl)

source: FOUR TIMES THE GRPAHICS!
el: ΤΕΣΣΕΡΙΣ ΦΟΡΕΣ ΤΑ ΓΡΑΦΙΚΑ!

source: PS/2
el: ΠΣ/2 (PS/2)

source: Allows you to plug in peripherals such as a Keyboard or Mouse.
el: Σας επιτρέπει να συνδέσετε περιφερειακές συσκευές όπως ένα πληκτρολόγιο ή ποντίκι.

source: Fan Control
el: Έλεγχος Ανεμιστήρα

source: The system can use fans to cool down.
el: Το σύστημα μπορεί να χρησιμοποιήσει ανεμιστηράκια για να κρυώσει.

source: Connectors
el: Υποδοχές Σύνδεσης

source: Wow! Plug all your stuffs in!
el: Πω πω! Συνδέστε όλα τα πράγματά σας!

source: PC Speaker
el: Ηχείο Υ/Η

source: Certain beeps help for debugging.
el: Ορισμένα ηχητικά σήματα βοήθεια για τον εντοπισμό σφαλμάτων.

source: Stereo Sound
el: Στερεοφωνικός Ήχος

source: Plug in those fancy ear muff things that make noise!
el: Βάλτε εκείνα τα μικρά πράγματα στο αυτί σας που κάνουν θόρυβο!

source: 5.1 Audio
el: Ήχος 5.1

source: More realistic sound positioning.
el: Πιο ρεαλιστική τοποθέτηση του ήχου.

source: 7.1 Audio
el: Ήχος 7.1

source: Even More realistic sound positioning.
el: Ακόμη πιο ρεαλιστική τοποθέτηση του ήχου.

source: 4D Audio
el: Ήχος 4D

source: It's almost as if you were there
el: Είναι σχεδόν σαν να ήσασταν εκεί

source: Universal Bus
el: Σειριακός Δίαυλος (USB)

source: That thing you always plug into your PC the wrong side... USB
el: Αυτό το πράγμα στο PC σας που το συνδέετε πάντα από τη λάθος πλευρά... USB

source: Universal Bus 2
el: Σειριακός Δίαυλος 2 (USB 2.0)

source: Now with faster data transfer, figuring out which side are you going to plug it in in the dark is still terrible
el: Τώρα με την ταχύτερη μεταφορά δεδομένων, υπολογίζοντας από ποια πλευρά θα το συνδέσετε μέσα στο σκοτάδι είναι ακόμη τρομερή

source: Universal Bus 3
el: Σειριακός Δίαυλος 3 (USB 3.0)

source: Woooo, a rapid fast USB colored in blue!
el: Ουάουυυυ, μια ταχεία γρήγορη USB με μπλέ χρώμα!

source: Boom!
el: Μπουμ!

source: Universal Bus 3.1
el: Σειριακός Δίαυλος 3.1 (USB 3.1)

source: Universal Bus 3.1 Type C
el: Καθολική λεωφορείο 3.1 τύπου C (USB 3.1c)

source: Finally reversible!
el: Τέλος αναστρέψιμo!

source: Indicators
el: Δείκτες

source: The things that flash.
el: Τα πράγματα που αναβοσβήνουν.

source: RGB Lights
el: Φώτα ΚΠΜ (RGB)

source: Ooooooh, multicoloured flashy
el: Ουάουυυυυ, φανταχτερό και πολύχρωμο

source: Processor
el: Επεξεργαστής

source: The brain of every computer.
el: Ο εγκέφαλος του κάθε υπολογιστή.

source: Default
el: Προεπιλεγμένο

source: Create a central processing unit!
el: Για να δημιουργήσετε μια κεντρική μονάδα επεξεργασίας!

source: Math Unit
el: Μαθηματική μονάδα

source: The Main Brain. Does things like finding "X" from "X=42^(1-4+9)
el: Ο κύριος εγκέφαλος. Κάνει πράγματα όπως το βρίσκει το «Χ» από την εξίσωση X=42^(1-4+9)

source: Divider
el: Διαιρέτης

source: Division without the thinking
el: Διαίρεση χωρίς σκέψη

source: APU
el: ΜΤΕ (APU)

source: An accelerrated processing unit, glueing the graphics chip onto the cpu.
el: Μια 'Μονάδα ταχείας επεξεργασίας', συγκόλληση το chip γραφικών πάνω στη cpu.

source: Parallel Math
el: Παράλληλα Μαθηματικά

source: What if you could do two things at once, on one core?
el: Τι θα γινόταν αν μπορούσατε να κάνετε δύο πράγματα ταυτόχρονα, μόνο με έναν πυρήνα;

source: Control Unit
el: Μονάδα Ελέγχου

source: The main controlling unit of the CPU.
el: Η κύρια μονάδα ελέγχου της CPU.

source: Hyper-threading
el: Υπερνημάτωση (Hyper-threading)

source: Cheat out consumers by faking them cores. Wooo!
el: Εξαπατήστε τους καταναλωτές με απομίμηση των πυρήνων. Ουάουυ!

source: Dual Core
el: Διπλο-Πύρηνο

source: Double those cores.
el: Διπλασιάστε αυτούς τους πυρήνες.

source: Quad Core
el: Τετρα-Πύρηνο

source: ... and again?
el: ... και πάλι;

source: Octo Core
el: Οκτα-Πύρηνο

source: ...... again?!
el: ... και πάλι;!

source: Heat Spreaders
el: Ψεκαστήρες θερμότητας

source: To prevent your CPU from replacing your grill
el: Για να αποτρέψετε την αντικατάσταση της σχάρας της CPU σας

source: Heat Pipes
el: Σωλήνες θερμότητας

source: Probably gives the most heat dissapation
el: Μάλλον δίνει την μεγαλύτερη διαρροή θερμότητας

source: Heat Fins
el: Πτερύγια Θερμότητας

source: Most definitely gives the most heat dissapation.
el: Δίνει πιο σίγουρα την μεγαλύτερη διαρροή θερμότητας.

source: Thermal Paste
el: Θερμική Πάστα

source: Help to transfer heat from CPU to the cooler
el: Βοήθεια για τη μεταφορά θερμότητας από τη CPU στο ψυγείο

source: Substrate
el: Υπόστρωμα

source: Move the heat on. Faster.
el: Μετακίνηση της θερμότητας. Πιο γρήγορα.

source: Arctic Paste
el: Αρκτική Πάστα

source: Move the heat on. Fastest.
el: Μετακίνηση της θερμότητας. Ταχύτατα.

source: Logic Unit
el: Λογική Μονάδα

source: The Other Main Brain. Does things like comparing two numbers
el: Ο Άλλος Κύριος Εγκεφάλος. Κάνει πράγματα όπως τη σύγκριση δύο αριθμών

source: Predicter
el: Predictοr

source: Can be used to improve logic
el: Μπορεί να χρησιμοποιηθεί για τη βελτίωση της λογικής

source: Fetcher
el: Φέτσερ

source: Hugely speeds up the fetching time from registers.
el: Επιταχύνει εξαιρετικά τη στιγμή γοητευτικός από μητρώα.

source: Registers
el: Μητρώα

source: Store numbers quickly.
el: Αριθμός καταστημάτων γρήγορα.

source: Cache
el: Μνήμη Cache

source: Caches hugely reduce the time needed to access memory.
el: Μνήμε Cache μειώνουν σημαντικά το χρόνο που απαιτείται για να αποκτήσει πρόσβαση στη μνήμη.

source: 2nd Level
el: 2ο Επίπεδο

source: Even faster than 1st Level cache, but laggier.
el: Ακόμη πιο γρήγορα από ό, τι το 1ο επίπεδο μνήμης cache, αλλά πιο αργό.

source: 3rd Level
el: 3ο Επίπεδο

source: Increasing speeds once again.
el: Αυξανόμενες ταχύτητες και πάλι.

source: On-Chip Memory
el: Μνήμη Σε-Τσιπ (On-Chip)

source: Integrates the 3rd level cache directly onto the chip, reducing the access time dramatically,
el: Ενσωματώνει το 3ο επίπεδο cache απευθείας πάνω στο τσιπ, μειώνοντας δραματικά, το χρόνο πρόσβασης

source: Power Efficiency
el: Ενεργειακή Απόδοση

source: Use less power! Save the planet!
el: Χρησιμοποιεί λιγότερη ενέργεια! Σώζουμε τον πλανήτη!

source: One giant leap in... making things smaller? Using smaller and smaller components has net a considerable power and efficiency increase.
el: Ένα γιγάντιο άλμα στο... κάνοντας τα πράγματα μικρότερα; Χρησιμοποιώντας όλο και μικρότερα στοιχεία έχει σημαντική αύξηση ενέργειας και αποδοτικότητας.

source: Yes, it really did take you four years to figure out how to save even ten percent more power on the chips themselves, you didn't want to sacrifice performance.
el: Ναι, Πραγματικά σας μεταφέρει τέσσερα χρόνια για να καταλάβετε πώς αποθηκεύει ακόμη και 10% περισσότερη ενέργεια για τα τσιπ τους, δεν θέλετε να θυσιάσετε την απόδοση.

source: A crazy scientist named "Bob" in the depths of your Research and Development dept. thinks he's solved the universe itself... or at least 7% more power savings.
el: Ένας τρελός επιστήμονας που ονομάζεται «Bob» στα βάθη της Έρευνάς σας και Ανάπτυξης πιστεύει ότι έχει λύσει το ίδιο το σύμπαν..., ή τουλάχιστον 7% περισσότερη εξοικονόμηση ενέργειας.

source: Capture Card
el: Κάρτα καταγραφής

source: Capture a PC!
el: Πάρτε ένα PC!

source: Default
el: Προεπιλεγμένο

source: Regular.
el: Κανονικό.

source: PCI Interface
el: Διασύνδεση ΠΔΣ (PCI)
