Repository: NarodGaming/hardwaremod-revamped
Catalog: translation/greek/hardware mod revamped greek - 70 finished.xliff
Languages: el

source: It plugs into a PCI Slot!
el: Αυτό συνδέεται σε μια υποδοχή ΠΔΣ (PCI)!

source: PCI Express
el: ΠΔΣ (PCI) Εξπρές

source: PCI Express is much faster!
el: Το ΠΔΣ (PCI) Εξπρές είναι πολύ πιο γρήγορo!

source: SD Resolution
el: Ανάλυση SD

source: Standard resolution, the one you hate on youtube.
el: Τυπική ανάλυση, το πράγμα που μισείς στο youtube.

source: "High" definition, not so high today...
el: «Υψηλή» ανάλυση, όχι τόσο υψηλή σήμερα...

source: The poormans FHD.
el: Το FHD των φτωχών ανθρώπων.

source: Because 1080i is for the poor.
el: Επειδή το 1080i είναι για τους φτωχούς.

source: For all of your 4k* needs. *Not actually 4k
el: Για τις 4Κ* ανάγκες σας. *Δεν είναι ακριβώς 4Κ

source: I mean, it's moving. Right?
el: Θέλω να πω, κινείται. Έτσι;

source: Gives you the cinematic feel.
el: Σας δίνει την κινηματογραφική αίσθηση.

source: The ultimate standard.
el: Το απόλυτο πρότυπο.

source: Backwards compatible with glorious 24FPS
el: Συμβατό με ένδοξο 24FPS

source: A direct upgrade to smooth motion, still backwards compatible wtih 30fps.
el: Μια άμεση αναβάθμιση στην ομαλή κίνηση, ακόμα προς τα πίσω συμβατό με 30fps.

source: Case
el: Πύργος
